Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxEray_reg.h
/** \brief 18C, Odd Sync ID Symbol Window 8 */
#define ERAY1_OSID_1S7 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OSID*)0xF001718Cu)
/** Alias (User Manual Name) for ERAY1_OSID_1S7.
* To use register names with standard convension, please use ERAY1_OSID_1S7.
*/
#define ERAY1_OSID08 (ERAY1_OSID_1S7)

/** \brief 190, Odd Sync ID Symbol Window 9 */
#define ERAY1_OSID_1S8 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OSID*)0xF0017190u)
/** Alias (User Manual Name) for ERAY1_OSID_1S8.
* To use register names with standard convension, please use ERAY1_OSID_1S8.
*/
#define ERAY1_OSID09 (ERAY1_OSID_1S8)

/** \brief 194, Odd Sync ID Symbol Window 10 */
#define ERAY1_OSID_1S9 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OSID*)0xF0017194u)
/** Alias (User Manual Name) for ERAY1_OSID_1S9.
* To use register names with standard convension, please use ERAY1_OSID_1S9.
*/
#define ERAY1_OSID10 (ERAY1_OSID_1S9)

/** \brief 198, Odd Sync ID Symbol Window 11 */
#define ERAY1_OSID_1S10 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OSID*)0xF0017198u)
/** Alias (User Manual Name) for ERAY1_OSID_1S10.
* To use register names with standard convension, please use ERAY1_OSID_1S10.
*/
#define ERAY1_OSID11 (ERAY1_OSID_1S10)

/** \brief 19C, Odd Sync ID Symbol Window 12 */
#define ERAY1_OSID_1S11 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OSID*)0xF001719Cu)
/** Alias (User Manual Name) for ERAY1_OSID_1S11.
* To use register names with standard convension, please use ERAY1_OSID_1S11.
*/
#define ERAY1_OSID12 (ERAY1_OSID_1S11)

/** \brief 1A0, Odd Sync ID Symbol Window 13 */
#define ERAY1_OSID_1S12 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OSID*)0xF00171A0u)
/** Alias (User Manual Name) for ERAY1_OSID_1S12.
* To use register names with standard convension, please use ERAY1_OSID_1S12.
*/
#define ERAY1_OSID13 (ERAY1_OSID_1S12)

/** \brief 1A4, Odd Sync ID Symbol Window 14 */
#define ERAY1_OSID_1S13 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OSID*)0xF00171A4u)
/** Alias (User Manual Name) for ERAY1_OSID_1S13.
* To use register names with standard convension, please use ERAY1_OSID_1S13.
*/
#define ERAY1_OSID14 (ERAY1_OSID_1S13)

/** \brief 1A8, Odd Sync ID Symbol Window 15 */
#define ERAY1_OSID_1S14 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_OSID*)0xF00171A8u)
/** Alias (User Manual Name) for ERAY1_OSID_1S14.
* To use register names with standard convension, please use ERAY1_OSID_1S14.
*/
#define ERAY1_OSID15 (ERAY1_OSID_1S14)

/** \brief 1B0, Network Management Vector 1 */
#define ERAY1_NMV_1S0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_NMV*)0xF00171B0u)
/** Alias (User Manual Name) for ERAY1_NMV_1S0.
* To use register names with standard convension, please use ERAY1_NMV_1S0.
*/
#define ERAY1_NMV1 (ERAY1_NMV_1S0)

/** \brief 1B4, Network Management Vector 2 */
#define ERAY1_NMV_1S1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_NMV*)0xF00171B4u)
/** Alias (User Manual Name) for ERAY1_NMV_1S1.
* To use register names with standard convension, please use ERAY1_NMV_1S1.
*/
#define ERAY1_NMV2 (ERAY1_NMV_1S1)

/** \brief 1B8, Network Management Vector 3 */
#define ERAY1_NMV_1S2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_NMV*)0xF00171B8u)
/** Alias (User Manual Name) for ERAY1_NMV_1S2.
* To use register names with standard convension, please use ERAY1_NMV_1S2.
*/
#define ERAY1_NMV3 (ERAY1_NMV_1S2)

/** \brief 300, Message RAM Configuration */
#define ERAY1_MRC /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_MRC*)0xF0017300u)

/** \brief 304, FIFO Rejection Filter */
#define ERAY1_FRF /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_FRF*)0xF0017304u)

/** \brief 308, FIFO Rejection Filter Mask */
#define ERAY1_FRFM /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_FRFM*)0xF0017308u)

/** \brief 30C, FIFO Critical Level */
#define ERAY1_FCL /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_FCL*)0xF001730Cu)

/** \brief 310, Message Handler Status */
#define ERAY1_MHDS /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_MHDS*)0xF0017310u)

/** \brief 314, Last Dynamic Transmit Slot */
#define ERAY1_LDTS /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_LDTS*)0xF0017314u)

/** \brief 318, FIFO Status Register */
#define ERAY1_FSR /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_FSR*)0xF0017318u)

/** \brief 31C, Message Handler Constraints Flags */
#define ERAY1_MHDF /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_MHDF*)0xF001731Cu)

/** \brief 320, Transmission Request Register 1 */
#define ERAY1_TXRQ1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_TXRQ1*)0xF0017320u)

/** \brief 324, Transmission Request Register 2 */
#define ERAY1_TXRQ2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_TXRQ2*)0xF0017324u)

/** \brief 328, Transmission Request Register 3 */
#define ERAY1_TXRQ3 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_TXRQ3*)0xF0017328u)

/** \brief 32C, Transmission Request Register 4 */
#define ERAY1_TXRQ4 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_TXRQ4*)0xF001732Cu)

/** \brief 330, New Data Register 1 */
#define ERAY1_NDAT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_NDAT1*)0xF0017330u)

/** \brief 334, New Data Register 2 */
#define ERAY1_NDAT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_NDAT2*)0xF0017334u)

/** \brief 338, New Data Register 3 */
#define ERAY1_NDAT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_NDAT3*)0xF0017338u)

/** \brief 33C, New Data Register 4 */
#define ERAY1_NDAT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_NDAT4*)0xF001733Cu)

/** \brief 340, Message Buffer Status Changed 1 */
#define ERAY1_MBSC1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_MBSC1*)0xF0017340u)

/** \brief 344, Message Buffer Status Changed 2 */
#define ERAY1_MBSC2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_MBSC2*)0xF0017344u)

/** \brief 348, Message Buffer Status Changed 3 */
#define ERAY1_MBSC3 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_MBSC3*)0xF0017348u)

/** \brief 34C, Message Buffer Status Changed 4 */
#define ERAY1_MBSC4 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_MBSC4*)0xF001734Cu)

/** \brief 3A8, New Data Interrupt Control 1 */
#define ERAY1_NDIC1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_NDIC1*)0xF00173A8u)

/** \brief 3AC, New Data Interrupt Control 2 */
#define ERAY1_NDIC2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_NDIC2*)0xF00173ACu)

