Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxEray_reg.h
/** \brief 3B0, New Data Interrupt Control 3 */
#define ERAY1_NDIC3 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_NDIC3*)0xF00173B0u)

/** \brief 3B4, New Data Interrupt Control 4 */
#define ERAY1_NDIC4 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_NDIC4*)0xF00173B4u)

/** \brief 3B8, Message Buffer Status Changed Interrupt Control 1 */
#define ERAY1_MSIC1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_MSIC1*)0xF00173B8u)

/** \brief 3BC, Message Buffer Status Changed Interrupt Control 2 */
#define ERAY1_MSIC2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_MSIC2*)0xF00173BCu)

/** \brief 3C0, Message Buffer Status Changed Interrupt Control 3 */
#define ERAY1_MSIC3 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_MSIC3*)0xF00173C0u)

/** \brief 3C4, Message Buffer Status Changed Interrupt Control 4 */
#define ERAY1_MSIC4 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_MSIC4*)0xF00173C4u)

/** \brief 3F0, Core Release Register */
#define ERAY1_CREL /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_CREL*)0xF00173F0u)

/** \brief 3F4, Endian Register */
#define ERAY1_ENDN /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_ENDN*)0xF00173F4u)

/** \brief 400, Write Data Section 1 */
#define ERAY1_WRDS_1S0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017400u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S0.
* To use register names with standard convension, please use ERAY1_WRDS_1S0.
*/
#define ERAY1_WRDS01 (ERAY1_WRDS_1S0)

/** \brief 404, Write Data Section 2 */
#define ERAY1_WRDS_1S1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017404u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S1.
* To use register names with standard convension, please use ERAY1_WRDS_1S1.
*/
#define ERAY1_WRDS02 (ERAY1_WRDS_1S1)

/** \brief 408, Write Data Section 3 */
#define ERAY1_WRDS_1S2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017408u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S2.
* To use register names with standard convension, please use ERAY1_WRDS_1S2.
*/
#define ERAY1_WRDS03 (ERAY1_WRDS_1S2)

/** \brief 40C, Write Data Section 4 */
#define ERAY1_WRDS_1S3 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001740Cu)
/** Alias (User Manual Name) for ERAY1_WRDS_1S3.
* To use register names with standard convension, please use ERAY1_WRDS_1S3.
*/
#define ERAY1_WRDS04 (ERAY1_WRDS_1S3)

/** \brief 410, Write Data Section 5 */
#define ERAY1_WRDS_1S4 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017410u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S4.
* To use register names with standard convension, please use ERAY1_WRDS_1S4.
*/
#define ERAY1_WRDS05 (ERAY1_WRDS_1S4)

/** \brief 414, Write Data Section 6 */
#define ERAY1_WRDS_1S5 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017414u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S5.
* To use register names with standard convension, please use ERAY1_WRDS_1S5.
*/
#define ERAY1_WRDS06 (ERAY1_WRDS_1S5)

/** \brief 418, Write Data Section 7 */
#define ERAY1_WRDS_1S6 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017418u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S6.
* To use register names with standard convension, please use ERAY1_WRDS_1S6.
*/
#define ERAY1_WRDS07 (ERAY1_WRDS_1S6)

/** \brief 41C, Write Data Section 8 */
#define ERAY1_WRDS_1S7 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001741Cu)
/** Alias (User Manual Name) for ERAY1_WRDS_1S7.
* To use register names with standard convension, please use ERAY1_WRDS_1S7.
*/
#define ERAY1_WRDS08 (ERAY1_WRDS_1S7)

/** \brief 420, Write Data Section 9 */
#define ERAY1_WRDS_1S8 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017420u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S8.
* To use register names with standard convension, please use ERAY1_WRDS_1S8.
*/
#define ERAY1_WRDS09 (ERAY1_WRDS_1S8)

/** \brief 424, Write Data Section 10 */
#define ERAY1_WRDS_1S9 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017424u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S9.
* To use register names with standard convension, please use ERAY1_WRDS_1S9.
*/
#define ERAY1_WRDS10 (ERAY1_WRDS_1S9)

/** \brief 428, Write Data Section 11 */
#define ERAY1_WRDS_1S10 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017428u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S10.
* To use register names with standard convension, please use ERAY1_WRDS_1S10.
*/
#define ERAY1_WRDS11 (ERAY1_WRDS_1S10)

/** \brief 42C, Write Data Section 12 */
#define ERAY1_WRDS_1S11 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001742Cu)
/** Alias (User Manual Name) for ERAY1_WRDS_1S11.
* To use register names with standard convension, please use ERAY1_WRDS_1S11.
*/
#define ERAY1_WRDS12 (ERAY1_WRDS_1S11)

/** \brief 430, Write Data Section 13 */
#define ERAY1_WRDS_1S12 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017430u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S12.
* To use register names with standard convension, please use ERAY1_WRDS_1S12.
*/
#define ERAY1_WRDS13 (ERAY1_WRDS_1S12)

/** \brief 434, Write Data Section 14 */
#define ERAY1_WRDS_1S13 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017434u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S13.
* To use register names with standard convension, please use ERAY1_WRDS_1S13.
*/
#define ERAY1_WRDS14 (ERAY1_WRDS_1S13)

/** \brief 438, Write Data Section 15 */
#define ERAY1_WRDS_1S14 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017438u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S14.
* To use register names with standard convension, please use ERAY1_WRDS_1S14.
*/
#define ERAY1_WRDS15 (ERAY1_WRDS_1S14)

/** \brief 43C, Write Data Section 16 */
#define ERAY1_WRDS_1S15 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001743Cu)
/** Alias (User Manual Name) for ERAY1_WRDS_1S15.
* To use register names with standard convension, please use ERAY1_WRDS_1S15.
*/
#define ERAY1_WRDS16 (ERAY1_WRDS_1S15)

/** \brief 440, Write Data Section 17 */
#define ERAY1_WRDS_1S16 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017440u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S16.
* To use register names with standard convension, please use ERAY1_WRDS_1S16.
*/
#define ERAY1_WRDS17 (ERAY1_WRDS_1S16)

