Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxEray_reg.h
/** \brief 444, Write Data Section 18 */
#define ERAY1_WRDS_1S17 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017444u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S17.
* To use register names with standard convension, please use ERAY1_WRDS_1S17.
*/
#define ERAY1_WRDS18 (ERAY1_WRDS_1S17)

/** \brief 448, Write Data Section 19 */
#define ERAY1_WRDS_1S18 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017448u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S18.
* To use register names with standard convension, please use ERAY1_WRDS_1S18.
*/
#define ERAY1_WRDS19 (ERAY1_WRDS_1S18)

/** \brief 44C, Write Data Section 20 */
#define ERAY1_WRDS_1S19 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001744Cu)
/** Alias (User Manual Name) for ERAY1_WRDS_1S19.
* To use register names with standard convension, please use ERAY1_WRDS_1S19.
*/
#define ERAY1_WRDS20 (ERAY1_WRDS_1S19)

/** \brief 450, Write Data Section 21 */
#define ERAY1_WRDS_1S20 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017450u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S20.
* To use register names with standard convension, please use ERAY1_WRDS_1S20.
*/
#define ERAY1_WRDS21 (ERAY1_WRDS_1S20)

/** \brief 454, Write Data Section 22 */
#define ERAY1_WRDS_1S21 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017454u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S21.
* To use register names with standard convension, please use ERAY1_WRDS_1S21.
*/
#define ERAY1_WRDS22 (ERAY1_WRDS_1S21)

/** \brief 458, Write Data Section 23 */
#define ERAY1_WRDS_1S22 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017458u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S22.
* To use register names with standard convension, please use ERAY1_WRDS_1S22.
*/
#define ERAY1_WRDS23 (ERAY1_WRDS_1S22)

/** \brief 45C, Write Data Section 24 */
#define ERAY1_WRDS_1S23 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001745Cu)
/** Alias (User Manual Name) for ERAY1_WRDS_1S23.
* To use register names with standard convension, please use ERAY1_WRDS_1S23.
*/
#define ERAY1_WRDS24 (ERAY1_WRDS_1S23)

/** \brief 460, Write Data Section 25 */
#define ERAY1_WRDS_1S24 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017460u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S24.
* To use register names with standard convension, please use ERAY1_WRDS_1S24.
*/
#define ERAY1_WRDS25 (ERAY1_WRDS_1S24)

/** \brief 464, Write Data Section 26 */
#define ERAY1_WRDS_1S25 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017464u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S25.
* To use register names with standard convension, please use ERAY1_WRDS_1S25.
*/
#define ERAY1_WRDS26 (ERAY1_WRDS_1S25)

/** \brief 468, Write Data Section 27 */
#define ERAY1_WRDS_1S26 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017468u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S26.
* To use register names with standard convension, please use ERAY1_WRDS_1S26.
*/
#define ERAY1_WRDS27 (ERAY1_WRDS_1S26)

/** \brief 46C, Write Data Section 28 */
#define ERAY1_WRDS_1S27 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001746Cu)
/** Alias (User Manual Name) for ERAY1_WRDS_1S27.
* To use register names with standard convension, please use ERAY1_WRDS_1S27.
*/
#define ERAY1_WRDS28 (ERAY1_WRDS_1S27)

/** \brief 470, Write Data Section 29 */
#define ERAY1_WRDS_1S28 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017470u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S28.
* To use register names with standard convension, please use ERAY1_WRDS_1S28.
*/
#define ERAY1_WRDS29 (ERAY1_WRDS_1S28)

/** \brief 474, Write Data Section 30 */
#define ERAY1_WRDS_1S29 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017474u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S29.
* To use register names with standard convension, please use ERAY1_WRDS_1S29.
*/
#define ERAY1_WRDS30 (ERAY1_WRDS_1S29)

/** \brief 478, Write Data Section 31 */
#define ERAY1_WRDS_1S30 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017478u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S30.
* To use register names with standard convension, please use ERAY1_WRDS_1S30.
*/
#define ERAY1_WRDS31 (ERAY1_WRDS_1S30)

/** \brief 47C, Write Data Section 32 */
#define ERAY1_WRDS_1S31 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001747Cu)
/** Alias (User Manual Name) for ERAY1_WRDS_1S31.
* To use register names with standard convension, please use ERAY1_WRDS_1S31.
*/
#define ERAY1_WRDS32 (ERAY1_WRDS_1S31)

/** \brief 480, Write Data Section 33 */
#define ERAY1_WRDS_1S32 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017480u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S32.
* To use register names with standard convension, please use ERAY1_WRDS_1S32.
*/
#define ERAY1_WRDS33 (ERAY1_WRDS_1S32)

/** \brief 484, Write Data Section 34 */
#define ERAY1_WRDS_1S33 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017484u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S33.
* To use register names with standard convension, please use ERAY1_WRDS_1S33.
*/
#define ERAY1_WRDS34 (ERAY1_WRDS_1S33)

/** \brief 488, Write Data Section 35 */
#define ERAY1_WRDS_1S34 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017488u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S34.
* To use register names with standard convension, please use ERAY1_WRDS_1S34.
*/
#define ERAY1_WRDS35 (ERAY1_WRDS_1S34)

/** \brief 48C, Write Data Section 36 */
#define ERAY1_WRDS_1S35 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001748Cu)
/** Alias (User Manual Name) for ERAY1_WRDS_1S35.
* To use register names with standard convension, please use ERAY1_WRDS_1S35.
*/
#define ERAY1_WRDS36 (ERAY1_WRDS_1S35)

/** \brief 490, Write Data Section 37 */
#define ERAY1_WRDS_1S36 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017490u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S36.
* To use register names with standard convension, please use ERAY1_WRDS_1S36.
*/
#define ERAY1_WRDS37 (ERAY1_WRDS_1S36)

/** \brief 494, Write Data Section 38 */
#define ERAY1_WRDS_1S37 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017494u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S37.
* To use register names with standard convension, please use ERAY1_WRDS_1S37.
*/
#define ERAY1_WRDS38 (ERAY1_WRDS_1S37)

/** \brief 498, Write Data Section 39 */
#define ERAY1_WRDS_1S38 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF0017498u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S38.
* To use register names with standard convension, please use ERAY1_WRDS_1S38.
*/
#define ERAY1_WRDS39 (ERAY1_WRDS_1S38)

/** \brief 49C, Write Data Section 40 */
#define ERAY1_WRDS_1S39 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001749Cu)
/** Alias (User Manual Name) for ERAY1_WRDS_1S39.
* To use register names with standard convension, please use ERAY1_WRDS_1S39.
*/
#define ERAY1_WRDS40 (ERAY1_WRDS_1S39)

/** \brief 4A0, Write Data Section 41 */
#define ERAY1_WRDS_1S40 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174A0u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S40.
* To use register names with standard convension, please use ERAY1_WRDS_1S40.
*/
#define ERAY1_WRDS41 (ERAY1_WRDS_1S40)

/** \brief 4A4, Write Data Section 42 */
#define ERAY1_WRDS_1S41 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174A4u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S41.
* To use register names with standard convension, please use ERAY1_WRDS_1S41.
*/
#define ERAY1_WRDS42 (ERAY1_WRDS_1S41)

/** \brief 4A8, Write Data Section 43 */
#define ERAY1_WRDS_1S42 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174A8u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S42.
* To use register names with standard convension, please use ERAY1_WRDS_1S42.
*/
#define ERAY1_WRDS43 (ERAY1_WRDS_1S42)

/** \brief 4AC, Write Data Section 44 */
#define ERAY1_WRDS_1S43 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174ACu)
/** Alias (User Manual Name) for ERAY1_WRDS_1S43.
* To use register names with standard convension, please use ERAY1_WRDS_1S43.
*/
#define ERAY1_WRDS44 (ERAY1_WRDS_1S43)

/** \brief 4B0, Write Data Section 45 */
#define ERAY1_WRDS_1S44 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174B0u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S44.
* To use register names with standard convension, please use ERAY1_WRDS_1S44.
*/
#define ERAY1_WRDS45 (ERAY1_WRDS_1S44)

/** \brief 4B4, Write Data Section 46 */
#define ERAY1_WRDS_1S45 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174B4u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S45.
* To use register names with standard convension, please use ERAY1_WRDS_1S45.
*/
#define ERAY1_WRDS46 (ERAY1_WRDS_1S45)

/** \brief 4B8, Write Data Section 47 */
#define ERAY1_WRDS_1S46 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174B8u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S46.
* To use register names with standard convension, please use ERAY1_WRDS_1S46.
*/
#define ERAY1_WRDS47 (ERAY1_WRDS_1S46)

/** \brief 4BC, Write Data Section 48 */
#define ERAY1_WRDS_1S47 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174BCu)
/** Alias (User Manual Name) for ERAY1_WRDS_1S47.
* To use register names with standard convension, please use ERAY1_WRDS_1S47.
*/
#define ERAY1_WRDS48 (ERAY1_WRDS_1S47)

/** \brief 4C0, Write Data Section 49 */
#define ERAY1_WRDS_1S48 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF00174C0u)
/** Alias (User Manual Name) for ERAY1_WRDS_1S48.
* To use register names with standard convension, please use ERAY1_WRDS_1S48.
*/
#define ERAY1_WRDS49 (ERAY1_WRDS_1S48)

